#Завдання для циклу for:

#1. Виведіть всі непарні числа в інтервалі від 1 до 20 за допомогою 
#циклу for.

# for n in range (1, 21):
#     if n%2!=0:
#         print (n)
# print ("\n")

# #2. Створіть список чисел та знайдіть суму всіх елементів у списку за 
# #допомогою циклу for.
# sum=0
# my_list2 = [2, 13, 4, 5, 6]
# for n in my_list2:
#     sum=sum+n
# print(sum)
# print ("\n")


# #3. Створіть список слів і виведіть слова, які містять більше ніж 5 літер, 
# #за допомогою циклу for.

# my_list3 = ["qwerty", "qwertyu", "qw", "qwer"]
# for i in my_list3:
#     if len(i)>5:
#         print (i)
# print ("\n")


# #4. Створіть список, який містить числа від 1 до 10. Виведіть всі числа,
# #крім числа 3, за допомогою циклу for.

# my_list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# for n in my_list4:
#     if n!=3:
#         print (n)
# print ("\n")


# 5. Створіть список з різних типів даних (числа, рядки, булеві значення)
# і виведіть тип кожного елемента за допомогою циклу for.

# my_list5 = ["dkhf", 1, 4, False, "sdlfnd", True]
# for n in my_list5:
#     print (type(n))
# print ("\n")

#Завдання для циклу while:

#1. Використовуючи цикл while, виведіть всі парні числа в 
#інтервалі від 1 до 20.
# list1 = [*range(1, 21)]
# n=1
# while n<len(list1):
#     if n%2==0:
#         print (n)
#         n+=1
#     else:
#         n+=1
# print ("\n")


#2. Створіть змінну "сума" і додавайте до неї числа від 1 до 10 
#за допомогою циклу while. Виведіть отриману суму.
# sum=0
# n=1
# while n<=10:
#     sum=sum+n
#     n+=1
# print (sum)
# print ("\n")

# 3. Створіть змінну "лічильник" (counter) та використовуйте цикл while,
# щоб підрахувати кількість чисел, які діляться на 5 в інтервалі
# від 1 до 100.
# counter = 0
# n=0
# list3=[*range(0,100)]
# while n<len(list3):
#     if list3[n]%5==0:
#         counter+=1
#         n+=1
#     elif list3[n]%5!=0:
#         n+=1
# print (counter)
# print ("\n")    


# 4. Запитайте користувача про пароль. Використовуйте цикл while, щоб 
# продовжувати запитувати пароль, поки він не введе правильний пароль.
# parol = "qwerty"
# parol_user = str(input ("Input your password"))
# while parol_user!=parol:
#     parol_user=str(input ("Input your password"))
# print ("Password is wright")
# print ("\n")

# 5. Створіть список чисел та виведіть його елементи з використанням 
# циклу while.
# list5=[*range(1,10)]
# n=0
# while n<len(list5):
#     print(list5[n])
#     n+=1
# print("\n")

#Завдання на структури даних в Пайтоні:

# 1. Створіть список (list), що містить ваші улюблені кольори. 
#  Виведіть перший і останній елементи списку.
# list_color=["red", "green", "brown", "black"]
# print (list_color[0])
# print (list_color[-1])
# print ("\n")

# 2. Створіть кортеж (tuple), який містить назви місяців року. 
# Спробуйте змінити один з елементів кортежу і переконайтеся, що 
# отримаєте помилку.
# tuple_month=("jan", "feb", "mar", "apr", "may", "june")
# tuple_month.append("july")


# 3. Створіть дві множини (set), які містять числа від 1 до 10 та
# від 5 до 15 відповідно. Виведіть їхнє об'єднання, перетин та різницю.

# set1 = {1, 2, 3 , 4, 5, 6, 7, 8, 9, 10}
# set2 = {5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15}
# print (set1.union(set2))
# print (set2.intersection(set1))
# print (set1.difference(set2))
# print (set2.difference(set1))
# print ("\n")

# 4. Створіть список (list), що містить кілька імен і прізвищ. 
# Відсортуйте список за алфавітом і виведіть його відсортований варіант.
#list_name = {"alex", "piter", "jack", "john", "mari"}
# print (list_name)
# print (sorted (list_name))

# 5. Створіть множину (set), яка містить парні числа від 1 до 20. 
# Створіть ще одну множину, яка містить числа, які діляться на 3. 
# Виведіть об'єднання обох множин.
# set51={2,4,6,8,10,12,14,16,18,20}
# set52={3,6,9,12,15,18}
# print (set51.union(set52))



# 6. Створіть кортеж (tuple), який містить різні типи даних, такі як числа, 
# рядки і булеві значення.
# my_tuple = (1, 3, True, "jsdhfgsj", 7)

# # 7. Створіть список (list) з чисел і виведіть суму всіх чисел в списку.
# list71 = [1,5,123,3,7,9,89]
# print (sum(list71))

# 8. Створіть кортеж (tuple), що містить різні предмети
# (наприклад, фрукти, книги, іграшки). Виведіть п'ятий елемент кортежу.
# my_tuple81=("ball", "book", "toy", 4567, "A", 4, "sdjkhf")
# print (my_tuple81[5])


# 9. Створіть список (list) зі словами. Виведіть всі слова, які мають
# більше 5 літер.
# list91=["asdljfhldfhlkjg", "Ahgsdhgkfh", "sd", "sd34fjblj", "q"]
# for n in list91:
#     if len(n)>5:
#         print (n)

# 10. Створити список студентів (кортежів із іменем та середнім балом).
# Знайти студента з найвищим середнім балом та вивести його ім'я.
# stud=("alex", 4.6, "john", 5.8, "jack", 7.3)
# studhigh = int()
# for n in stud:
#     if type (n) != str:
#         if n > studhigh:
#             studhigh = i
#         else:
#             pass
#     else:
#         pass
# print (studhigh)


# 11. Створити список замовлень (кортежів, які містять номер замовлення 
#та суму). Знайти загальну суму всіх замовлень і вивести її.
# order_1 = (234, 84)
# order_2 = (231, 38)
# order_3 = (230, 76)
# sum=0

# order_list = {order_1, order_2, order_3}
# for i in order_list:
#     sum=sum+i[-1]
# print (sum)




# 12. Створити список кортежів із даними про відвідувачів сайту 
# (IP-адреса та час відвідування). Знайти найпопулярніший час доби, 
# коли сайт найбільше відвідують.Реалізуйте функцію для підрахунку
# загальної кількості відвідувань сайту.Виведіть загальну кількість 
# відвідувань
# visitor_1 = (236457, "m")
# visitor_2 = (234556, "d")
# visitor_3 = (123456, "e")
# visitor_4 = (374836, "d")
# count_m=0
# count_d=0
# count_e=0

# visit_list = [visitor_1, visitor_2, visitor_3, visitor_4]
# for i in visit_list:
#     if i[-1]=="m":
#         count_m+=1
#     elif i[-1]=="d":
#         count_d+=1
#     elif i[-1]=="e":
#         count_e+=1
# print ("morning:", count_m, "day:",count_d, ",evening:",count_e)
# print (f""all orders:", {count_m+count_d+count_e}")


# 13. Створити список кортежів, де кожен кортеж містить назву товару
#та ціну. Обчислити загальну вартість товарів з урахуванням податку
#та вивести її.
# goods_1 = ("banan", 123)
# goods_2 = ("auto", 34)
# goods_3 = ("phone", 128.4)
# goods_4 = ("apple", 21.5)
# tax = 1.2
# sum=0

# goods_list = [goods_1, goods_2, goods_3, goods_4]
# for i in goods_list:
#     i[-1]=i[-1]*tax
#     sum+=i[-1]
#     print (sum)


# 14. Створити список замовлень, де кожен замовлення - це кортеж, що
# містить ім'я клієнта, список товарів та їх кількість. Розрахувати загальну 
# суму кожного замовлення та вивести її. Визначити, які клієнти зробили 
# замовлення на суму більше ніж певне значення і вивести їх імена.
list_order=[tuple1, tuple2, tuple3]
tuple1=("a",list_t11, list_t12)
tuple2=("b",list_t21, list_t22)
tuple3=("c",list_t31, list_t32)
list_t11=[""]