# 1. Телефонний довідник:

# Створити словник, де ключами є імена людей, а значеннями - їхні номери 
#телефонів.
# Додати новий контакт до телефонного довідника.
# Знайти номер телефону за ім'ям.
my_dict1 = {"alex": "1234567", "piter": "4657893", "vasyl": "5898026"}
my_dict1.update({"mari": "3009857"})
my_dict1["pavlo"]=6578493
print (my_dict1["alex"])
print ("\n")

# 2. Підрахунок літер:

# Створити словник, де ключами є літери, а значеннями - їхні кількості 
# у рядку.
# Знайти кількість вказаних літер у заданому рядку.
my_dict2={"a": 3, "s": 8, "d": 2, "f": 11}
print (my_dict2["a"])
print ("\n")

# 3. Робота з цінами товарів:

# Створити словник, де ключами є назви товарів, а значеннями - їхні ціни.
# Знайти ціну товару за його назвою.
# Додати новий товар та його ціну до словника.
my_dict3={"banan": 23, "tomat": 6, "egg": 17, "cheese": 389}
my_dict3.update({"beer": 20})
print (my_dict3)
print (my_dict3["egg"])
print ("\n")


# 4. Співставлення даних:

# Створити два словники з іменами та віками людей.
# Знайти вік особи за її ім'ям.
# Співставити дані із двох словників та створити загальний словник 
# з іменами та віками.
my1={"q": 23, "w": 39, "e": 10, "r": 2}
my2={"a": 53, "s": 59, "d":3, "r": 2}
my1.update(my2)
print (my1)
print ("\n")

# 5. Вартість покупок:

# Створити словник з назвами товарів та їхніми цінами.
# Створити список покупок та розрахувати загальну вартість.
my_dict5={"banan": 23, "tomat": 6, "egg": 17, "cheese": 389}
print("banan", "egg")
price=int(my_dict5["banan"])+int(my_dict5["egg"])
print(price)
print ("\n")

#6. Рейтинг учнів:
#Створити словник з іменами учнів і їхніми оцінками.
#Знайти середній бал усіх учнів.

class_dict={"q": 10, "w": 8.3, "e": 6.8, "r": 10}
ave_sum=float((class_dict["q"]+class_dict["w"]+class_dict["e"]+class_dict["r"])/4)
print (ave_sum)
print ("\n")

#Завдання на list, set i dict comprehensions

# 1. Згенеруйте простий список чисел від 1 до 10
list1=[n for n in range(1,11)]
print(list1)
print ("\n")

# 2. Згенеруйте список квадратів чисел від 1 до 10
list2=[n**2 for n in range(1,11)]
print(list2)
print ("\n")

# 3. Згенеруйте список лише з парними числами (початковий список - це послідовність чисел від 1 до 20)
list3=[n for n in range(1,21) if n%2==0]
print(list3)
print ("\n")


#4. Згенеруйте колекцію даних з відфільтрованими унікальними голосними
#  літерами у рядку (тобто вам заздалегідь треба написати якийсь рядок 
# тексту і на основі нього згенерувати нову послідовність)
my_set={"e","r","y","o","j","r","u","i","w","o","a"}
set4={n for n in my_set if n!="r" and n!="w" and n!="j"}
print (set4)
print ("\n")


#5. Згенеруйте словник, де ключами є числа від 1 до 5, а значеннями їх квадрати.
my_dict5={i: i**2 for i in range (1,6)}
print (my_dict5)
print ("\n")

#6. Створіть словник на основі списку імен, де у value має міститись довжина
#(кількість букв) імені.
list_name=["piter", "paul", "johnhy"]
dict6={n: len(list_name[list_name.index(n)]) for n in list_name}
print(dict6)
print ("\n")

#7. Створіть словник на основі двох списків - з іменами та прізвищами. 
#Ключем може бути ім'я, а значенням - прізвище. Або навпаки:)
list_name=["qw", "fg", "th", "re"]
list_surname=["a", "y", "t", "a"]
dict7={key: list_surname[list_name.index(key)] for key in list_name}
print (dict7)