# Завдання 1
# Практика імпорту
# Створити каталог з 2 модулів; внести в одну з них функцію; потім 
# імпортуйте цю функцію в інший модуль і використовуйте її у сценарії за 
# вибором.
from file_function import func_my
num_1=38
num_2=5
x=func_my(num_1,num_2)
print(x)

# Завдання 2
# Модуль sys.
# Список “sys.path” ініціалізується зі змінної середовища PYTHONPATH. 
# Чи можна змінити це з Python? Якщо так, чи впливає це на те, де Python
# шукає файли модулів? Виконайте кілька інтерактивних тестів, щоб дізнатися це.
